import json

dict = {
    "mainCategories":[
        {
            "name" : "Raghavendra Tirtharu",
            "imgLink": "assets/images/RaghavendraSwami.jpg",
            "subCategories": [
                                {
                                    "name" : "॥ ಶ್ರೀರಾಘವೇನ್ದ್ರಸ್ತೋತ್ರಮ್ ॥",
                                    "author": "ಅಪ್ಪಣ್ಣಾಚಾರ್ಯ",
                                    "description" : """
ಶ್ರೀಪೂರ್ಣಬೋಧಗುರುತೀರ್ಥಪಯೋಬ್ಧಿಪಾರಾ ಕಾಮಾರಿಮಾಕ್ಷವಿಷಮಾಕ್ಷಶಿರಃ ಸ್ಪೃಶನ್ತೀ ।
ಪೂರ್ವೋತ್ತರಾಮಿತತರಂಗಚರತ್ಸುಹಂಸಾ ದೇವಾಳಿಸೇವಿತಪರಾಂಘ್ರಿಪಯೋಜಲಗ್ನಾ ॥ 1॥

ಜೀವೇಶಭೇದಗುಣಪೂರ್ತಿಜಗತ್ಸುಸತ್ತ್ವ ನೀಚೋಚ್ಚಭಾವಮುಖನಕ್ರಗಣೈಃ ಸಮೇತಾ ।
ದುರ್ವಾದ್ಯಜಾಪತಿಗಿಳೈರ್ಗುರುರಾಘವೇನ್ದ್ರವಾಗ್ದೇವತಾಸರಿದಮುಂ ವಿಮಲೀಕರೋತು ॥ 2॥

ಶ್ರೀರಾಘವೇನ್ದ್ರಃ ಸಕಲಪ್ರದಾತಾ ಸ್ವಪಾದಕಂಜದ್ವಯಭಕ್ತಿಮದ್ಭ್ಯಃ ।
ಅಘಾದ್ರಿಸಮ್ಭೇದನದೃಷ್ಟಿವಜ್ರಃ ಕ್ಷಮಾಸುರೇನ್ದ್ರೋಽವತು ಮಾಂ ಸದಾಽಯಮ್ ॥ 3॥

ಶ್ರೀರಾಘವೇನ್ದ್ರೋಹರಿಪಾದಕಂಜನಿಷೇವಣಾಲ್ಲಬ್ಧಸಮಸ್ತಸಮ್ಪತ್ ।
ದೇವಸ್ವಭಾವೋ ದಿವಿಜದ್ರುಮೋಽಯಮಿಷ್ಟಪ್ರದೋ ಮೇ ಸತತಂ ಸ ಭೂಯಾತ್ ॥ 4॥

ಭವ್ಯಸ್ವರೂಪೋ ಭವದುಃಖತೂಲಸಂಘಾಗ್ನಿಚರ್ಯಃ ಸುಖಧೈರ್ಯಶಾಲೀ ।
ಸಮಸ್ತದುಷ್ಟಗ್ರಹನಿಗ್ರಹೇಶೋ ದುರತ್ಯಯೋಪಪ್ಲವಸಿನ್ಧುಸೇತುಃ ॥ 5॥

ನಿರಸ್ತದೋಷೋ ನಿರವದ್ಯವೇಷಃ ಪ್ರತ್ಯರ್ಥಿಮೂಕತ್ತ್ವನಿದಾನಭಾಷಃ ।
ವಿದ್ವತ್ಪರಿಜ್ಞೇಯಮಹಾವಿಶೇಷೋ ವಾಗ್ವೈಖರೀನಿರ್ಜಿತಭವ್ಯಶೇಷಃ ॥ 6॥

ಸನ್ತಾನಸಮ್ಪತ್ಪರಿಶುದ್ಧಭಕ್ತಿವಿಜ್ಞಾನವಾಗ್ದೇಹಸುಪಾಟವಾದೀನ್ ।
ದತ್ತ್ವಾ ಶರೀರೋತ್ಥಸಮಸ್ತದೋಷಾನ್ ಹತ್ತ್ವಾ ಸ ನೋಽವ್ಯಾದ್ಗುರುರಾಘವೇನ್ದ್ರಃ ॥ 7॥

ಯತ್ಪಾದೋದಕಸಂಚಯಃ ಸುರನದೀಮುಖ್ಯಾಪಗಾಸಾದಿತಾ-
ಸಂಖ್ಯಾಽನುತ್ತಮಪುಣ್ಯಸಂಘವಿಲಸತ್ಪ್ರಖ್ಯಾತಪುಣ್ಯಾವಹಃ ।
ದುಸ್ತಾಪತ್ರಯನಾಶನೋ ಭುವಿ ಮಹಾ ವನ್ಧ್ಯಾಸುಪುತ್ರಪ್ರದೋ
ವ್ಯಂಗಸ್ವಂಗಸಮೃದ್ಧಿದೋ ಗ್ರಹಮಹಾಪಾಪಾಪಹಸ್ತಂ ಶ್ರಯೇ ॥ 8॥

ಯತ್ಪಾದಕಂಜರಜಸಾ ಪರಿಭೂಷಿತಾಂಗಾ ಯತ್ಪಾದಪದ್ಮಮಧುಪಾಯಿತಮಾನಸಾ ಯೇ ।
ಯತ್ಪಾದಪದ್ಮಪರಿಕೀರ್ತನಜೀರ್ಣವಾಚಸ್ತದ್ದರ್ಶನಂ ದುರಿತಕಾನನದಾವಭೂತಮ್ ॥ 9॥

ಸರ್ವತನ್ತ್ರಸ್ವತನ್ತ್ರೋಽಸೌ ಶ್ರೀಮಧ್ವಮತವರ್ಧನಃ ।
ವಿಜಯೀನ್ದ್ರಕರಾಬ್ಜೋತ್ಥಸುಧೀನ್ದ್ರವರಪುತ್ರಕಃ ।
ಶ್ರೀರಾಘವೇನ್ದ್ರೋ ಯತಿರಾಟ್ ಗುರುರ್ಮೇ ಸ್ಯಾದ್ಭಯಾಪಹಃ ॥ 10॥

ಜ್ಞಾನಭಕ್ತಿಸುಪುತ್ರಾಯುಃ ಯಶಃ ಶ್ರೀಪುಣ್ಯವರ್ಧನಃ ।
ಪ್ರತಿವಾದಿಜಯಸ್ವಾನ್ತಭೇದಚಿಹ್ನಾದರೋ ಗುರುಃ ।
ಸರ್ವವಿದ್ಯಾಪ್ರವೀಣೋಽನ್ಯೋ ರಾಘವೇನ್ದ್ರಾನ್ನವಿದ್ಯತೇ ॥ 11॥

ಅಪರೋಕ್ಷೀಕೃತಶ್ರೀಶಃ ಸಮುಪೇಕ್ಷಿತಭಾವಜಃ ।
ಅಪೇಕ್ಷಿತಪ್ರದಾತಾಽನ್ಯೋ ರಾಘವೇನ್ದ್ರಾನ್ನವಿದ್ಯತೇ ॥ 12॥

ದಯಾದಾಕ್ಷಿಣ್ಯವೈರಾಗ್ಯವಾಕ್ಪಾಟವಮುಖಾಂಕಿತಃ ।
ಶಾಪಾನುಗ್ರಹಶಕ್ತೋಽನ್ಯೋ ರಾಘವೇನ್ದ್ರಾನ್ನವಿದ್ಯತೇ ॥ 13॥

ಅಜ್ಞಾನವಿಸ್ಮೃತಿಭ್ರಾನ್ತಿಸಂಶಯಾಪಸ್ಮೃತಿಕ್ಷಯಾಃ ।
ತನ್ದ್ರಾಕಮ್ಪವಚಃಕೌಂಠ್ಯಮುಖಾ ಯೇ ಚೇನ್ದ್ರಿಯೋದ್ಭವಾಃ ।
ದೋಷಾಸ್ತೇ ನಾಶಮಾಯಾನ್ತಿ ರಾಘವೇನ್ದ್ರಪ್ರಸಾದತಃ ॥ 14॥

`ಓಂ ಶ್ರೀ ರಾಘವೇನ್ದ್ರಾಯ ನಮಃ '  ಇತ್ಯಷ್ಟಾಕ್ಷರಮನ್ತ್ರತಃ ।
ಜಪಿತಾದ್ಭಾವಿತಾನ್ನಿತ್ಯಂ ಇಷ್ಟಾರ್ಥಾಃ ಸ್ಯುರ್ನಸಂಶಯಃ ॥ 15॥

ಹನ್ತು ನಃ ಕಾಯಜಾನ್ದೋಷಾನಾತ್ಮಾತ್ಮೀಯಸಮುದ್ಭವಾನ್ ।
ಸರ್ವಾನಪಿ ಪುಮರ್ಥಾಂಶ್ಚ ದದಾತು ಗುರುರಾತ್ಮವಿತ್ ॥ 16॥

ಇತಿ ಕಾಲತ್ರಯೇ ನಿತ್ಯಂ ಪ್ರಾರ್ಥನಾಂ ಯಃ ಕರೋತಿ ಸಃ ।
ಇಹಾಮುತ್ರಾಪ್ತಸರ್ವೇಷ್ಟೋ ಮೋದತೇ ನಾತ್ರ ಸಂಶಯಃ ॥ 17॥

ಅಗಮ್ಯಮಹಿಮಾ ಲೋಕೇ ರಾಘವೇನ್ದ್ರೋ ಮಹಾಯಶಾಃ ।
ಶ್ರೀಮಧ್ವಮತದುಗ್ಧಾಬ್ಧಿಚನ್ದ್ರೋಽವತು ಸದಾಽನಘಃ ॥ 18॥

ಸರ್ವಯಾತ್ರಾಫಲಾವಾಪ್ತ್ಯೈ ಯಥಾಶಕ್ತಿಪ್ರದಕ್ಷಿಣಮ್ ।
ಕರೋಮಿ ತವ ಸಿದ್ಧಸ್ಯ ವೃನ್ದಾವನಗತಂ ಜಲಮ್ ।
ಶಿರಸಾ ಧಾರಯಾಮ್ಯದ್ಯ ಸರ್ವತೀರ್ಥಫಲಾಪ್ತಯೇ ॥ 19॥

ಸರ್ವಾಭೀಷ್ಟಾರ್ಥಸಿದ್ಧ್ಯರ್ಥಂ ನಮಸ್ಕಾರಂ ಕರೋಮ್ಯಹಮ್ ।
ತವ ಸಂಕೀರ್ತನಂ ವೇದಶಾಸ್ತ್ರಾರ್ಥಜ್ಞಾನಸಿದ್ಧಯೇ ॥ 20॥

ಸಂಸಾರೇಽಕ್ಷಯಸಾಗರೇ ಪ್ರಕೃತಿತೋಽಗಾಧೇ ಸದಾ ದುಸ್ತರೇ ।
ಸರ್ವಾವದ್ಯಜಲಗ್ರಹೈರನುಪಮೈಃ ಕಾಮಾದಿಭಂಗಾಕುಲೇ ।
ನಾನಾವಿಭ್ರಮದುರ್ಭ್ರಮೇಽಮಿತಭಯಸ್ತೋಮಾದಿಫೇನೋತ್ಕಟೇ ।
ದುಃಖೋತ್ಕೃಷ್ಟವಿಷೇ ಸಮುದ್ಧರ ಗುರೋ ಮಾ ಮಗ್ನರೂಪಂ ಸದಾ ॥ 21॥

ರಾಘವೇನ್ದ್ರಗುರುಸ್ತೋತ್ರಂ ಯಃ ಪಠೇದ್ಭಕ್ತಿಪೂರ್ವಕಮ್ ।
ತಸ್ಯ ಕುಷ್ಠಾದಿರೋಗಾಣಾಂ ನಿವೃತ್ತಿಸ್ತ್ವರಯಾ ಭವೇತ್ ॥ 22॥

ಅನ್ಧೋಽಪಿ ದಿವ್ಯದೃಷ್ಟಿಃ ಸ್ಯಾದೇಡಮೂಕೋಽಪಿ ವಾಗ್ಪತಿಃ ।
ಪೂರ್ಣಾಯುಃ ಪೂರ್ಣಸಮ್ಪತ್ತಿಃ ಸ್ತೋತ್ರಸ್ಯಾಸ್ಯ ಜಪಾದ್ಭವೇತ್ ॥ 23॥

ಯಃ ಪಿಬೇಜ್ಜಲಮೇತೇನ ಸ್ತೋತ್ರೇಣೈವಾಭಿಮನ್ತ್ರಿತಮ್ ।
ತಸ್ಯ ಕುಕ್ಷಿಗತಾ ದೋಷಾಃ ಸರ್ವೇ ನಶ್ಯನ್ತಿ ತತ್ಕ್ಷಣಾತ್ ॥ 24॥

ಯದ್ವೃನ್ದಾವನಮಾಸಾದ್ಯ ಪಂಗುಃ ಖಂಜೋಽಪಿ ವಾ ಜನಃ ।
ಸ್ತೋತ್ರೇಣಾನೇನ ಯಃ ಕುರ್ಯಾತ್ಪ್ರದಕ್ಷಿಣನಮಸ್ಕೃತಿ ।
ಸ ಜಂಘಾಲೋ ಭವೇದೇವ ಗುರುರಾಜಪ್ರಸಾದತಃ ॥ 25॥

ಸೋಮಸೂರ್ಯೋಪರಾಗೇ ಚ ಪುಷ್ಯಾರ್ಕಾದಿಸಮಾಗಮೇ ।
ಯೋಽನುತ್ತಮಮಿದಂ ಸ್ತೋತ್ರಮಷ್ಟೋತ್ತರಶತಂ ಜಪೇತ್ ।
ಭೂತಪ್ರೇತಪಿಶಾಚಾದಿಪೀಡಾ ತಸ್ಯ ನ ಜಾಯತೇ ॥ 26॥

ಏತತ್ಸ್ತೋತ್ರಂ ಸಮುಚ್ಚಾರ್ಯ ಗುರೋರ್ವೃನ್ದಾವನಾನ್ತಿಕೇ ।
ದೀಪಸಂಯೋಜನಾಜ್ಞಾನಂ ಪುತ್ರಲಾಭೋ ಭವೇದ್ಧ್ರುವಮ್ ॥ 27॥

ಪರವಾದಿಜಯೋ ದಿವ್ಯಜ್ಞಾನಭಕ್ತ್ಯಾದಿವರ್ಧನಮ್ ।
ಸರ್ವಾಭೀಷ್ಟಪ್ರವೃದ್ಧಿಸ್ಸ್ಯಾನ್ನಾತ್ರ ಕಾರ್ಯಾ ವಿಚಾರಣಾ ॥ 28॥

ರಾಜಚೋರಮಹಾವ್ಯಾಘ್ರಸರ್ಪನಕ್ರಾದಿಪೀಡನಮ್ ।
ನ ಜಾಯತೇಽಸ್ಯ ಸ್ತೋತ್ರಸ್ಯ ಪ್ರಭಾವಾನ್ನಾತ್ರ ಸಂಶಯಃ ॥ 29॥

ಯೋ ಭಕ್ತ್ಯಾ ಗುರುರಾಘವೇನ್ದ್ರಚರಣದ್ವನ್ದ್ವಂ ಸ್ಮರನ್ ಯಃ ಪಠೇತ್ ।
ಸ್ತೋತ್ರಂ ದಿವ್ಯಮಿದಂ ಸದಾ ನಹಿ ಭವೇತ್ತಸ್ಯಾಸುಖಂ ಕಿಂಚನ ।
ಕಿಂ ತ್ವಿಷ್ಟಾರ್ಥಸಮೃದ್ಧಿರೇವ ಕಮಲಾನಾಥಪ್ರಸಾದೋದಯಾತ್ ।
ಕೀರ್ತಿರ್ದಿಗ್ವಿದಿತಾ ವಿಭೂತಿರತುಲಾ ಸಾಕ್ಷೀ ಹಯಾಸ್ಯೋಽತ್ರ ಹಿ ॥ 30॥

ಇತಿ ಶ್ರೀ ರಾಘವೇನ್ದ್ರಾರ್ಯ ಗುರುರಾಜಪ್ರಸಾದತಃ ।
ಕೃತಂ ಸ್ತೋತ್ರಮಿದಂ ಪುಣ್ಯಂ ಶ್ರೀಮದ್ಭಿರ್ಹ್ಯಪ್ಪಣಾಭಿದೈಃ ॥ 31॥

ಇತಿ ಶ್ರೀ ಅಪ್ಪಣ್ಣಾಚಾರ್ಯವಿರಚಿತಂ
ಶ್ರೀರಾಘವೇನ್ದ್ರಸ್ತೋತ್ರಂ ಸಮ್ಪೂರ್ಣಮ್

॥ ಶ್ರೀಕೃಷ್ಣಾರ್ಪಣಮಸ್ತು ॥
            """
        },
            {
                "name" : "॥ ಜಯ ಜಯ ವೀವೆ ರಾಘವೇಂದ್ರ ॥",
                "author": "ವಿಠಲದಾಸ",
                "description" :"""
ಜಯ ಜಯ ವೀವೆ ರಾಘವೇಂದ್ರ
ಭವ ಭಯ ನಾಶಕ ರಾಘವೇಂದ್ರ
ತುಂಗಾ  ತೀರದಿ ರಾಘವೇಂದ್ರ
ಮಂಗಳ ಮಹಿಮನೆ ರಾಘವೇಂದ್ರ
ಅಂಗ ರಹಿತರಿಗೆ ರಾಘವೇಂದ್ರ
ತಿಮಣ್ಣನ ಸುತ ರಾಘವೇಂದ್ರ
ಕಂಗಳಿಲ್ಲದವರಿಗೆ  ರಾಘವೇಂದ್ರ
ಭೋಮ ಮಾರುತಿ ಪ್ರಿಯಾ ರಾಘವೇಂದ್ರ
ವೆಂಕಟ ನಾಮಕ  ರಾಘವೇಂದ್ರ
ಸಂಕಟ ಹಾರಕ ರಾಘವೇಂದ್ರ ||

ವೀಣಾ ಪಂಡಿತ ರಾಘವೇಂದ್ರ
ಗಾನ ವಿಶಾರದ ರಾಘವೇಂದ್ರ
ಸರಸ್ವತಿ ಪತಿ ರಾಘವೇಂದ್ರ
ಸರಸ್ವತಿ ವಿಧ್ಯಾ ರಾಘವೇಂದ್ರ
ಕುಂಭ ಕೋಣ ವಾಸ ರಾಘವೇಂದ್ರ
ಸುಧೀಂದ್ರ ಶಿಷ್ಯ ರಾಘವೇಂದ್ರ
ಪರಿಮಳ  ಪಂಡಿತ ರಾಘವೇಂದ್ರ
ಭಸ್ಯಕರ ಗುರು ರಾಘವೇಂದ್ರ
ಶಿಷ್ಯರ ವಿದ್ಯೆ ರಾಘವೇಂದ್ರ
ಆಯಾಸದಿಂ ಬರೆ ರಾಘವೇಂದ್ರ||

ಗಂಧವ ತೇಯನೇ  ರಾಘವೇಂದ್ರ
ಅಗ್ನಿ ಸೂಕ್ತದಿಂ ರಾಘವೇಂದ್ರ
ವಿಪ್ರರು ಲೇಪಿಸೆ  ರಾಘವೇಂದ್ರ
ಕ್ಷಿಪ್ರದಿ ಮೈ  ಉರಿ  ರಾಘವೇಂದ್ರ
ಶರಣು ಹೋಗಲು ರಾಘವೇಂದ್ರ
ವರುಣ ಸೂಕ್ತದಿಂ ರಾಘವೇಂದ್ರ
ಚಂದನ ವಾಯಿತು ರಾಘವೇಂದ್ರ
ಸುತನಿಗೆ ಮುಂಜಿಯು ರಾಘವೇಂದ್ರ
ಸನ್ಯಾಸಿ ಆಗಲು ರಾಘವೇಂದ್ರ
ಶಾರಡಗೇಣ್ಯೂ ರಾಘವೇಂದ್ರ||

ಆಶ್ರಮ ಧರಿಸಿದ ರಾಘವೇಂದ್ರ
ಪಿಶಾಚಿಯಾಗಿ  ಸತಿ ರಾಘವೇಂದ್ರ
ಮೋಕ್ಷವ ಗಯ್ಸಿದ ರಾಘವೇಂದ್ರ
ಚಾತು ಶಾಸ್ತಿ ಕಲೆಯಿಂದ ರಾಘವೇಂದ್ರ
ಅತುಳ ಪ್ರಕಾಶನೂ ರಾಘವೇಂದ್ರ
ಮೊದಲಿನ ಗುರುಗಳು ರಾಘವೇಂದ್ರ
ಯಾದವೇಂದ್ರರು ರಾಘವೇಂದ್ರ
ಅಧಿಕಾರ ನಮ್ಮದು ರಾಘವೇಂದ್ರ
ಅಧಿಕ ತೊಂದರೆ ಕೊಡೆ ರಾಘವೇಂದ್ರ
ಹರಿಯ ಸ್ಮರಿಸಲು ರಾಘವೇಂದ್ರ ||

ಪರಿಹಾರವಾಯಿತು ರಾಘವೇಂದ್ರ
ಬಡ ವೆಂಕಣ್ಣಗೆ  ರಾಘವೇಂದ್ರ
ಒಡನೆಯೇ  ದಯೆಯಿಂದ ರಾಘವೇಂದ್ರ
ದೀವಾನಾಗಿರಿ ಬರೆ ರಾಘವೇಂದ್ರ
ದೀವಾನಾ ದೊರೆಗಳೇ ರಾಘವೇಂದ್ರ
ಮುಸಲ್ಮಾನನ ದೊರೆ ರಾಘವೇಂದ್ರ
ತಟ್ಟೆಲಿ  ಭೋಜನ ರಾಘವೇಂದ್ರ
ಬಟ್ಟೆಯು ಮುಚ್ಚಿರೆ ರಾಘವೇಂದ್ರ
ತೀರ್ಥವ ಪ್ರೋಕ್ಷಿಷೆ  ರಾಘವೇಂದ್ರ
ತಟ್ಟೆಲಿ ಫಲ ಪುಷ್ಪ ರಾಘವೇಂದ್ರ ||

ವಂದಿಸಿದನು ದೊರೆ ರಾಘವೇಂದ್ರ
ಮಾನ್ಯಗಳನು ಕೊಡೆ ರಾಘವೇಂದ್ರ
ದೊರೆಯ ನೆನಪಿಗೆ ರಾಘವೇಂದ್ರ
ಗೋಪುರವಿರಿಸಿದ ರಾಘವೇಂದ್ರ
ವೆಂಕಣ್ಣಗೆ ಫಲ ರಾಘವೇಂದ್ರ
ಮಾಧವಾರದಿ ರಾಘವೇಂದ್ರ
ಕೆರೆ ಏರಿಯಾ ಮೇಲೆ ರಾಘವೇಂದ್ರ
ಕರಿಯ ಶಿಲೆಯೊಳು ರಾಘವೇಂದ್ರ
ಬೃಂದಾವನ ಮಾಡೆ ರಾಘವೇಂದ್ರ
ಉಳಿದ ಶಿಲೆಯೊಳು ರಾಘವೇಂದ್ರ ||

ಮಾರುತಿಯನು ಮಾಡಿ ರಾಘವೇಂದ್ರ
ಕೀರುತಿ ಪಡೆದರು ರಾಘವೇಂದ್ರ
ಉತ್ತಮ  ದಿನದೋಳು ರಾಘವೇಂದ್ರ
ಶಿಷ್ಯರಿಗೇಳುತ ರಾಘವೇಂದ್ರ
ದಕ್ಷಿಣ ದ್ವಾರದಿ ರಾಘವೇಂದ್ರ
ಆ ಕ್ಷಣ ಹೊಕಾರು ರಾಘವೇಂದ್ರ
ಒಂದು ದಿನ ಶ್ರೀಗಳು ರಾಘವೇಂದ್ರ
ಮದುವೆಗೆ ಶಿಷ್ಯ ಕೇಳೆ ರಾಘವೇಂದ್ರ
ಮೃತ್ತಿಕೆ  ಕೊಡಲಾಗಿ ರಾಘವೇಂದ್ರ ||

ದ್ವಿಜಗೆ ಜಾಗುಳಿಯೊಳಗೆ  ರಾಘವೇಂದ್ರ
ಬ್ರಹ್ಮ  ಫಿಶಾಚಿಯು ರಾಘವೇಂದ್ರ
ಮೃತ್ತಿಕೆಭರದಿಂದ ರಾಘವೇಂದ್ರ
ಸುಟ್ಟು ಬೂದಿಯಾಗೆ  ರಾಘವೇಂದ್ರ
ಶಿಷ್ಯನ ಮದುವೆಯೂ ರಾಘವೇಂದ್ರ
ರತ್ನ ಹರ ಭರದಿಂದ ರಾಘವೇಂದ್ರ
ಅಗ್ನಿಯೊಳಿತ್ತರು  ರಾಘವೇಂದ್ರ
ಹಾರ ಬೇಕೆನ್ನಲು  ರಾಘವೇಂದ್ರ
ಕುಂದದಿ ತೆಗೆದರು ರಾಘವೇಂದ್ರ
ನೀರಿನವನು ಕೇಳೆ ರಾಘವೇಂದ್ರ ||

ಮೋಕ್ಷ ಬೇಕೆನ್ನಲು  ರಾಘವೇಂದ್ರ
ಮುಕ್ತಿಯನಿತರು ರಾಘವೇಂದ್ರ
ದೇಸಾಯಿ ಒಂದು ದಿನ ರಾಘವೇಂದ್ರ
ಗುರುಗಳ ಕರೆಸಲು ರಾಘವೇಂದ್ರ
ಮಾವಿನ ರಸದೊಳು ರಾಘವೇಂದ್ರ
ಆಡುವ ಮಗು ಬೀಳೆ  ರಾಘವೇಂದ್ರ
ಮಗು ಮೃತ ಹೊಂದಲು ರಾಘವೇಂದ್ರ
ಅಂದು ವ್ಯಥಿಸಿದರು  ರಾಘವೇಂದ್ರ
ರಾಮನ ದಯೆಯಿಂದ ರಾಘವೇಂದ್ರ
ಜೀವನವಿತ್ತರು  ರಾಘವೇಂದ್ರ ||

ಪರಿಜನ ಹರುಷದಿ ರಾಘವೇಂದ್ರ
ತರಳನ ಕರೆದರು ರಾಘವೇಂದ್ರ
ಗುರುಗಳ ಕರುಣಿಸಿ  ರಾಘವೇಂದ್ರ
ಪ್ರಾಣವನಿತ್ತರು  ರಾಘವೇಂದ್ರ
ವನಕೆ ಚಿಗುರಿಸಿ ರಾಘವೇಂದ್ರ
ವಿಪ್ರರಿಗೆ ಸಿರಿಬಂತು ರಾಘವೇಂದ್ರ
ಶಿಷ್ಯನ ಮಗನೊಬ್ಬ ರಾಘವೇಂದ್ರ
ಬಿಸಿಲಲಿ ಬಳಲಲು  ರಾಘವೇಂದ್ರ
ಶಾಟಿಲಿ ನೆರಳನು ರಾಘವೇಂದ್ರ
ಇಚ್ಚಾ ಭೋಜನ ರಾಘವೇಂದ್ರ ||

ಜಾತಕ ಬರೆಯಲು ರಾಘವೇಂದ್ರ
ಒಂದು ನೂರು ಮನುಜಂಗೆ ರಾಘವೇಂದ್ರ
ಮೂರು ನೂರು ಗ್ರಂಥಕೆ ರಾಘವೇಂದ್ರ
ಬೃಂದಾವನ ಕೇಲುನೂರು ರಾಘವೇಂದ್ರ
ಪರಿ ಪರಿ ರೋಗಹಾರ ರಾಘವೇಂದ್ರ
ಜಯ ಜಯ ಮಂಗಳ ರಾಘವೇಂದ್ರ
ಜಯ ಜಯ ವಿಠಲದಾಸ ರಾಘವೇಂದ್ರ
ನಿತ್ಯ ನಾಡದೊಳು ರಾಘವೇಂದ್ರ ||
""" 
            }
            ]
        }
    ]
}

jsonData = json.dumps(dict, ensure_ascii=False, indent=4)

print(jsonData)

with open(r"assets\json\data.json", "w", encoding="utf-8") as fd:
    fd.write(jsonData)
    